-- 샘플 테이블 조회 해보기
-- vscode에서 실행하는 방법, 한문장 단위 실행: command + Enter, Ctrl + Enter
-- 주의사항 최초 실행시 vscode 측에서 서버를 선택하는 메뉴가 나오면
--이전에 설치한 연결 설정을 확인하기
select * from emp;
-- 현재 시간조회
select sysdate FROM dual;


-- 🔹 ① 셀렉션 (Selection) – 행 중심 조회
-- 특정 조건을 만족하는 **행(Row)**만 조회
--- sql
--- SELECT * 해당 테이블의 모든 컬럼 조회
-- FROM EMP 조회할 테이블 명
--- WHERE JOB = 값 'MANAGER'; 조건을 만족하는 문구
-- 예시: WHERE JOB = 'MANAGER';
-- 해석 emp 테이블에서 JOB 컬럼의 값이 MANAGER인 행 조회
SELECT * FROM EMP   
WHERE JOB = 'MANAGER';
-- ### 🔹 ② 프로젝션 (Projection) – 열 중심 조회
-- 특정 **열(Column)**만 조회
-- sql
-- 보고싶은열 ename 사원이름, sal 급여
select ename, sal from emp;
select * from emp;


--### 셀렉션 + 프로젝션 함꼐사용

-- sql
--보고싶은 열 ename 사원이름, sal 급여
-- where 조건 sal 급여가 2000 이상인 행 조회
SELECT ename, sal FROM emp
WHERE sal > 2000;